tutorials/waveFoamGABC/solitary3DPorous/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevation
{
    type waveGauge;

    pointDistribution lineDistribution;
    N 414;
    stretch   1;
    linestart (-6.19875 0 -.45);
    lineend   (-0.00375 0 -.45);
    add       ( 0 0 .8);
    axis      z;   

    writeControl adjustableRunTime;
    writeInterval 0.025;
}


// ************************************************************************* //
